SiliconLabs/simplicity_sdk/platform/radio/rail_lib/chip/efr32/protocol_config/efr32xg21/ble_efr32xg21_configurator_out.c
/***************************************************************************//**
 * @brief RAIL Configuration
 * @details
 *   WARNING: Auto-Generated Radio Config  -  DO NOT EDIT
 *   Radio Configurator Version: 2404.4.4 (42ce28d3f3)
 *   RAIL Adapter Version: 2.4.33 (e3d4627956)
 *   RAIL Compatibility: 2.x
 *******************************************************************************
 * # License
 * <b>Copyright 2019 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 ******************************************************************************/
#include "em_device.h"
#include "ble_efr32xg21_configurator_out.h"

static const uint8_t irCalConfig[] = {
  25, 63, 1, 6, 4, 16, 1, 0, 0, 1, 1, 6, 0, 16, 39, 0, 0, 12, 0, 0, 0, 0, 0, 0, 0, 0
};

static const int32_t timingConfig_0[] = {
  50000, 9500, 500, 500
};

static const int32_t timingConfig_1[] = {
  50000, 5500, 1500, 1500
};

static const int32_t timingConfig_2[] = {
  187125, 9500, 500, 500
};

static const int32_t timingConfig_3[] = {
  49125, 9500, 500, 500
};

#ifdef RADIO_CONFIG_ENABLE_STACK_INFO
static const uint8_t stackInfo_0[2] = { 0x03, 0x00 };
#endif // RADIO_CONFIG_ENABLE_STACK_INFO

static RAIL_ChannelConfigEntryAttr_t channelConfigEntryAttr = {
#if RAIL_SUPPORTS_OFDM_PA
  {
#ifdef RADIO_CONFIG_ENABLE_IRCAL_MULTIPLE_RF_PATHS
    { 0xFFFFFFFFUL, 0xFFFFFFFFUL, },
#else
    { 0xFFFFFFFFUL },
#endif // RADIO_CONFIG_ENABLE_IRCAL_MULTIPLE_RF_PATHS
    { 0xFFFFFFFFUL, 0xFFFFFFFFUL }
  }
#else // RAIL_SUPPORTS_OFDM_PA
#ifdef RADIO_CONFIG_ENABLE_IRCAL_MULTIPLE_RF_PATHS
  { 0xFFFFFFFFUL, 0xFFFFFFFFUL, },
#else
  { 0xFFFFFFFFUL },
#endif // RADIO_CONFIG_ENABLE_IRCAL_MULTIPLE_RF_PATHS
#endif // RAIL_SUPPORTS_OFDM_PA
};

static const uint32_t phyInfo_0[] = {
  18UL,
  0x00400000UL, // 64.0
  (uint32_t) NULL,
  (uint32_t) irCalConfig,
  (uint32_t) timingConfig_0,
  0x00000000UL,
  8793864UL,
  32000000UL,
  1000000UL,
  0x00000101UL,
  0x02504911UL,
  (uint32_t) NULL,
  (uint32_t) NULL,
  (uint32_t) NULL,
  0UL,
  0UL,
  999978UL,
  (uint32_t) NULL,
  (uint32_t) NULL,
  (uint32_t) NULL,
};

static const uint32_t phyInfo_1[] = {
  18UL,
  0x00800000UL, // 128.0
  (uint32_t) NULL,
  (uint32_t) irCalConfig,
  (uint32_t) timingConfig_1,
  0x00000000UL,
  8800000UL,
  32000000UL,
  2000000UL,
  0x00000101UL,
  0x02504911UL,
  (uint32_t) NULL,
  (uint32_t) NULL,
  (uint32_t) NULL,
  0UL,
  0UL,
  1999957UL,
  (uint32_t) NULL,
  (uint32_t) NULL,
  (uint32_t) NULL,
};

static const uint32_t phyInfo_2[] = {
  18UL,
  0x00800000UL, // 128.0
  (uint32_t) NULL,
  (uint32_t) irCalConfig,
  (uint32_t) timingConfig_2,
  0x00000000UL,
  9840000UL,
  32000000UL,
  1000000UL,
  0x00000801UL,
  0x02504911UL,
  (uint32_t) NULL,
  (uint32_t) NULL,
  (uint32_t) NULL,
  0UL,
  0UL,
  999998UL,
  (uint32_t) NULL,
  (uint32_t) NULL,
  (uint32_t) NULL,
};

static const uint32_t phyInfo_3[] = {
  18UL,
  0x00800000UL, // 128.0
  (uint32_t) NULL,
  (uint32_t) irCalConfig,
  (uint32_t) timingConfig_3,
  0x00000000UL,
  9840000UL,
  32000000UL,
  1000000UL,
  0x00000201UL,
  0x02504911UL,
  (uint32_t) NULL,
  (uint32_t) NULL,
  (uint32_t) NULL,
  0UL,
  0UL,
  999998UL,
  (uint32_t) NULL,
  (uint32_t) NULL,
  (uint32_t) NULL,
};

const uint32_t ble_viterbi1M_modemConfigBase[] = {
  0x0002400CUL, 0x00018101UL, /* Write: FRC.DFLCTRL */
  /*    4010 */ 0x00004100UL, /* FRC.MAXLENGTH */
  0x00024020UL, 0x00000000UL, /* Write: FRC.WCNTCMP0 */
  /*    4024 */ 0x00000001UL, /* FRC.WCNTCMP1 */
  0x00034030UL, 0x00000000UL, /* Write: FRC.WHITECTRL */
  /*    4034 */ 0x00000000UL, /* FRC.WHITEPOLY */
  /*    4038 */ 0x00000000UL, /* FRC.WHITEINIT */
  0x00024040UL, 0x00000000UL, /* Write: FRC.BLOCKRAMADDR */
  /*    4044 */ 0x00000000UL, /* FRC.CONVRAMADDR */
  0x000140A8UL, 0x00000007UL, /* Write: FRC.AUTOCG */
  0x000340B8UL, 0x00004CFFUL, /* Write: FRC.FCD1 */
  /*    40BC */ 0x00004DFFUL, /* FRC.FCD2 */
  /*    40C0 */ 0x00004DFFUL, /* FRC.FCD3 */
  0x0001C008UL, 0x00000000UL, /* Write: AGC.STATUS0 */
  0x1001C01CUL, 0x0007F800UL, /* AND: AGC.CTRL0 */
  0x3001C01CUL, 0x000802F5UL, /* OR: AGC.CTRL0 */
  0x1001C020UL, 0x000000FFUL, /* AND: AGC.CTRL1 */
  0x3001C020UL, 0x00001300UL, /* OR: AGC.CTRL1 */
  0x0004C024UL, 0x03B380ECUL, /* Write: AGC.CTRL2 */
  /*    C028 */ 0x02A87543UL, /* AGC.CTRL3 */
  /*    C02C */ 0x00000000UL, /* AGC.RSSISTEPTHR */
  /*    C030 */ 0x0000022EUL, /* AGC.MANGAIN */
  0x0001C050UL, 0x0C304187UL, /* Write: AGC.GAINRANGE */
  0x0002C058UL, 0x08070654UL, /* Write: AGC.HICNTREGION */
  /*    C05C */ 0x0002B6D1UL, /* AGC.STEPDWN */
  0x0008C064UL, 0x00003004UL, /* Write: AGC.GAINSTEPLIM */
  /*    C068 */ 0x06102040UL, /* AGC.PNRFATT0 */
  /*    C06C */ 0x1848F2C8UL, /* AGC.PNRFATT1 */
  /*    C070 */ 0x00F6E81FUL, /* AGC.PNRFATT2 */
  /*    C074 */ 0x15724BBDUL, /* AGC.LNAMIXCODE0 */
  /*    C078 */ 0x0518A311UL, /* AGC.LNAMIXCODE1 */
  /*    C07C */ 0x76543210UL, /* AGC.PGACODE0 */
  /*    C080 */ 0x00000A98UL, /* AGC.PGACODE1 */
  0x0001C088UL, 0x00000000UL, /* Write: AGC.LBT */
  0x01010008UL, 0x00000708UL, /* Write: RFCRC.CTRL */
  0x01010018UL, 0x00AAAAAAUL, /* Write: RFCRC.INIT */
  0x01010020UL, 0x00DA6000UL, /* Write: RFCRC.POLY */
  0x0101401CUL, 0x00000010UL, /* Write: MODEM.MIXCTRL */
  0x01034030UL, 0x03000000UL, /* Write: MODEM.CTRL4 */
  /*    4034 */ 0x00000000UL, /* MODEM.CTRL5 */
  /*    4038 */ 0x00000000UL, /* MODEM.CTRL6 */
  0x01024068UL, 0x71764129UL, /* Write: MODEM.SYNC0 */
  /*    406C */ 0x00000000UL, /* MODEM.SYNC1 */
  0x010240E0UL, 0x00000033UL, /* Write: MODEM.DCCOMP */
  /*    40E4 */ 0x00000000UL, /* MODEM.DCCOMPFILTINIT */
  0x0101410CUL, 0x001255B8UL, /* Write: MODEM.DIGMIXCTRL */
  0x01014124UL, 0x00000000UL, /* Write: MODEM.AUTOCG */
  0x01054154UL, 0x00000001UL, /* Write: MODEM.LRFRC */
  /*    4158 */ 0x00000000UL, /* MODEM.COH0 */
  /*    415C */ 0x00000000UL, /* MODEM.COH1 */
  /*    4160 */ 0x00000000UL, /* MODEM.COH2 */
  /*    4164 */ 0x00000000UL, /* MODEM.COH3 */
  0x01024238UL, 0x00000000UL, /* Write: MODEM.SYNCPROPERTIES */
  /*    423C */ 0x00000000UL, /* MODEM.DIGIGAINCTRL */
  0x01014244UL, 0x00000000UL, /* Write: MODEM.PADEBUG */
  0x01018010UL, 0x00000003UL, /* Write: SYNTH.CTRL */
  0x01028038UL, 0x00104911UL, /* Write: SYNTH.IFFREQ */
  /*    803C */ 0x00000001UL, /* SYNTH.DIVCTRL */
  0x01018088UL, 0x00000000UL, /* Write: SYNTH.LOCNTCTRL */
  0x0101809CUL, 0x000240EBUL, /* Write: SYNTH.LPFCTRL1CAL */
  0x010280B0UL, 0x02000300UL, /* Write: SYNTH.DSMCTRLRX */
  /*    80B4 */ 0x01000037UL, /* SYNTH.DSMCTRLTX */
  0x02020088UL, 0x04000C00UL, /* Write: RAC.SYNTHREGCTRL */
  /*    008C */ 0x0000004CUL, /* RAC.VCOCTRL */
  0x02010094UL, 0x00000400UL, /* Write: RAC.SYNTHCTRL */
  0x020200D0UL, 0x0000000EUL, /* Write: RAC.IFADCDBG */
  /*    00D4 */ 0x08960290UL, /* RAC.IFADCTRIM */
  0x020100E4UL, 0x0442093DUL, /* Write: RAC.LNAMIXTRIM0 */
  0x020100F4UL, 0x00000000UL, /* Write: RAC.LNAMIXEN */
  0x02010118UL, 0x02510060UL, /* Write: RAC.PGACTRL */
  0xFFFFFFFFUL,
};

